[
"Light from the Sun takes 8 minutes to reach Earth",
  "Dinosaurs lived 45 million years ago",
"A year 8,760 has hours in it",
"Some cats are allergic to humans",
  "Tsundoku is the act of acquiring books and not reading them",
  "Ravens in captivity can learn to talk better than parrots",
  "You can still visit Blockbuster stores in Alaska and Oregon",
  "Blood donors in Sweden receive a thank you text when their blood is used",
  "An estimated 1 million dogs in the U.S. have been named primary beneficiary in their owners' wills",
"In Japan, letting a sumo wrestler make your baby cry is considered good luck",
  "Portland was named by a coin flip. Had the coin landed the other way, the city would be Boston, Oregon",
  "The first sales pitch for the Nerf ball was 'Nerf: You can’t hurt babies or old people!'",
  "Russian cosmonauts used to pack a shotgun in case they landed in Siberia and had to fend off bears",
  "Space has a distinct smell: a bouquet of diesel fumes, gunpowder, and barbecue",
  "The annual number of worldwide shark bites is 10 times less than the number of people bitten by other people in New York",
  "After an online vote in 2011, Toyota announced that the official plural of Prius was Prii",
  "Tootsie Rolls were added to soldiers' rations in World War II for their durability in all weather conditions",
"Both John Adams and Thomas Jefferson died on July 4, 1826-exactly 50 years after the adoption of the Declaration of Independence",
  "Scientists have found evidence of take-out restaurants in the remains of Pompeii",
  "The average person walks the equivalent of 5 laps around the world during their lifetime",
  "The scientific name for brain freeze is sphenopalatine ganglioneuralgia",
  "In 1992, 29,000 rubber ducks were lost at sea, and they are still being discovered in unexpected places",
  "Globally, only 2 percent of the population has green eyes",
  "A New Jersey man flunked out of law school and subsequently sued the school for having accepted him in the first place",
  "The top speed of the first American car race in 1895 for 7 mph",
  "Barbed wire was invented in 1845 and was largely responsible for putting cowboys out of business since it provided cheap and easy fencing",
  "The first written instance of OMG that we know of was in a letter to Winston Churchill in 1917",
  "The designer of the Eiffel Tower built an apartment in the tower itself. Though he didn’t live there, he did use it to entertain distinguished guests and scientists",
  "Ernest Wright's 1939 novel Gadsby does not contain the letter 'e'",
  "The only word that rhymes with purple is 'hirple' which means 'to limp awkwardly'. Nothing rhymes with 'woman'",
  "Phobophobia is the fear of having a phobia. Symptoms include dizziness, excessive sweating, increased heart rate, and faintness",
  "Simply taking 1 step uses over 200 muscles in the body",
  "People are more likely to agree with a statement written in Baskerville than any other font",
  "Google processed 11.382 billion searches in September 2015",
  "Parents have started naming their children after Instagram filters. The most popular filter name was Lux, but there were even a few Kelvins",
  "At age 23, Evan Spiegel, the founder of Snapchat, is the world's youngest billionaire",
  "The world’s oldest socks were in fact designed to be worn with sandals. Made in Egypt sometime in the fourth or fifth century, the wool socks have two toes",
  "Due to a genetic defect, cats can’t taste sweet things",
  "A Peruvian bulldog named Otto holds the world record for skateboarding through the longest human tunnel",
  "The McDonald’s in Sedona, Arizona, is the only one in the world with turquoise arches instead of golden ones",
  "A Frosted Flake in the shape of Illinois sold on eBay for $1,350",
  "The reason peppers taste so hot is because they contain a chemical compound call capsaicin, which tricks sensory nerves into thinking they're being burned by fire",
  "A single elephant tooth can weigh up to 9 lbs",
  "The microwave was invented by accident when engineer Percy Spencer walked by a radar set and the candy bar in his pocket melted",
  "Contrary to its portrayal in Jurassic Park, the Tyrannosaurus rex probably didn't roar. Instead, scientists believe it either hissed or rattled, like a rattlesnake",
  "3 out of 4 Americans use an emoji in text messaging every single day",
  "The average person will spend a total of 3,680 hours, or 153 days searching for misplaced items",
  "Every time you lick a USPS stamp, you ingest about 10 percent of a calorie",
  "There are over 1,000 adaptations of Shakespeare's works",
  "The first U.S. town to be completely lit by electric streetlights was Wabash, Indiana, in 1880",
  "Cornell University scientists have created a functioning guitar the size of a human blood cell"


]